In [1]:
import re
import pandas as pd

In [2]:
text = re.search("\d","A2")

In [4]:
text.group()

'2'

In [6]:
re.search("\D","A2").group()

'A'

In [10]:
text = "my phone number is 505-555-5555"
re.search("(\d\d\d)-(\d\d\d)-(\d\d\d\d)",text).group()

'505-555-5555'

In [13]:
text = "my phone number is 505-555-5555"
re.search("(\d\d\d)-(\d\d\d-\d\d\d\d)",text).group(1)
re.search("(\d\d\d)-(\d\d\d-\d\d\d\d)",text).group(2)

'555-5555'

In [11]:
text = "my phone number is 505 555-5555"
re.search("(\d\d\d) (\d\d\d)-(\d\d\d\d)",text).group()

'505 555-5555'

In [15]:
text = "my phone number is (505) 555-5555"
re.search("(\(\d\d\d\)) (\d\d\d)-(\d\d\d\d)",text).group()

'(505) 555-5555'

In [22]:
text = "one 1, ten ÅŸs 10, one hunded is 100 "
for i in text:
    a = re.search("\d", i)
    if a is not None:
        print(a.group())

1
1
0
1
0
0

In [23]:
re.findall('\d', text)

['1', '1', '0', '1', '0', '0']

In [24]:
re.findall('\d{1,3}', text)

['1', '10', '100']

In [26]:
text = "2004-959-559 # this is phone number"
re.sub('\D',"",text)

'2004959559'

In [27]:
re.sub('\D', '.', text)

'2004.959.559.......................'

In [28]:
txt = "hello world"

In [35]:
output = re.findall("world$", txt)
print(output)

['world']

In [37]:
output = re.findall("^hello", txt)
print(output)

['hello']

In [30]:
 s = pd.Series(['a3', 'b4','c5'])

In [38]:
s.str.extract('(\d)')

   0
0  3
1  4
2  4

In [39]:
s.str.extract('(\w)')

   0
0  a
1  b
2  c

In [40]:
pd.Series(['a3aaa', 'b4aaa','c5aaa']).str.extract('(\w\d)')

    0
0  a3
1  b4
2  c5

In [42]:
s

0     06/2020\n\n4.9 l/100 km (comb)
1     11/2020\n\n166 g CO2/km (comb)
2     10/2019\n\n5.3 l/100 km (comb)
3     05/2022\n\n6.3 l/100 km (comb)
4     07/2019\n\n128 g CO2/km (comb)
5     06/2022\n\n112 g CO2/km (comb)
6     01/2022\n\n5.8 l/100 km (comb)
7     11/2020\n\n106 g CO2/km (comb)
8     04/2019\n\n105 g CO2/km (comb)
9     08/2020\n\n133 g CO2/km (comb)
10    04/2022\n\n133 g CO2/km (comb)
dtype: object

In [43]:
s= pd.Series(['40 l/100 km (comb)',
        '38 l/100 km (comb)', '6.4 l/100 km (comb)',
       '8.3 kg/100 km (comb)', '5.1 kg/100 km (comb)',
       '5.4 l/100 km (comb)', '6.7 l/100 km (comb)',
       '6.2 l/100 km (comb)', '7.3 l/100 km (comb)',
       '6.3 l/100 km (comb)', '5.7 l/100 km (comb)',
       '6.1 l/100 km (comb)', '6.8 l/100 km (comb)',
       '7.5 l/100 km (comb)', '7.4 l/100 km (comb)',
       '3.6 kg/100 km (comb)', '0 l/100 km (comb)',
       '7.8 l/100 km (comb)'])

In [49]:
s.str.extract('(\d\d|\d.\d|\d)')

      0
0    40
1    38
2   6.4
3   8.3
4   5.1
5   5.4
6   6.7
7   6.2
8   7.3
9   6.3
10  5.7
11  6.1
12  6.8
13  7.5
14  7.4
15  3.6
16    0
17  7.8

In [52]:
s.str.extract('(\d\d|\d.\d|\d).+(\d\d\d)')

      0    1
0    40  100
1    38  100
2   6.4  100
3   8.3  100
4   5.1  100
5   5.4  100
6   6.7  100
7   6.2  100
8   7.3  100
9   6.3  100
10  5.7  100
11  6.1  100
12  6.8  100
13  7.5  100
14  7.4  100
15  3.6  100
16    0  100
17  7.8  100

In [53]:
s = pd.Series(['06/2020\n\n4.9 l/100 km (comb)',
'11/2020\n\n166 g CO2/km (comb)',
'10/2019\n\n5.3 l/100 km (comb)',
'05/2022\n\n6.3 l/100 km (comb)',
'07/2019\n\n128 g CO2/km (comb)',
'06/2022\n\n112 g CO2/km (comb)',
'01/2022\n\n5.8 l/100 km (comb)',
'11/2020\n\n106 g CO2/km (comb)',
'04/2019\n\n105 g CO2/km (comb)',
'08/2020\n\n133 g CO2/km (comb)',
'04/2022\n\n133 g CO2/km (comb)'])

In [58]:
s.str.extract('(\d\d).+(\d\d\d\d)')
s.str.extract('(\d{2}).(\d{4})')
s.str.extract('(\d*).(\d*)')

     0     1
0   06  2020
1   11  2020
2   10  2019
3   05  2022
4   07  2019
5   06  2022
6   01  2022
7   11  2020
8   04  2019
9   08  2020
10  04  2022

In [73]:
s.str.extract('(\d{2})/(\d\d\d\d)\n\n(\d\d\d|\d.\d)')

     0     1    2
0   06  2020  4.9
1   11  2020  166
2   10  2019  5.3
3   05  2022  6.3
4   07  2019  128
5   06  2022  112
6   01  2022  5.8
7   11  2020  106
8   04  2019  105
9   08  2020  133
10  04  2022  133